# 2887. Fill Missing Data
[問題](https://leetcode.com/problems/fill-missing-data/?envType=study-plan-v2&envId=introduction-to-pandas&lang=pythondata)

In [1]:
import pandas as pd

In [3]:
def fillMissingValues(products: pd.DataFrame) -> pd.DataFrame:
    products = products.fillna(value={"quantity": 0})
    return products

In [4]:
products = [["Wristwatch",None,135],["WirelessEarbuds",None,821],["GolfClubs",779,9319],["Printer",849,3051]]
headers = ["name","quantity","price"]

In [5]:
df = pd.DataFrame(products, columns=headers)

In [6]:
df

              name  quantity  price
0       Wristwatch       NaN    135
1  WirelessEarbuds       NaN    821
2        GolfClubs     779.0   9319
3          Printer     849.0   3051

In [7]:
fillMissingValues(df)

              name  quantity  price
0       Wristwatch       0.0    135
1  WirelessEarbuds       0.0    821
2        GolfClubs     779.0   9319
3          Printer     849.0   3051